src/Documents/Экспертиза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Экспертиза</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЭкспертиза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Экспертиза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>Курс валюты взаиморасчетов по договору</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРазмещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершилРазмещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновленИзТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеВыгружатьВТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРазмещено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПрихода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменаСТопЛогПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаСТопЛогПоОбъектам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОтложенноеПроведениеДокументовИзТопЛог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОтложенноеПроведениеДокументовИзТопЛог</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыПартии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыйНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыйНаКомиссию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийЭкспертиза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЭкспертиза</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеНаЭкспертизуОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаЭкспертизуПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщикаВВозврате</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИдентификаторыСтрокПриходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыСтрокПриходов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приход</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерестикеровкаПереоценка</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковПоРегиструТоварыНаСкладах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартии77</Name>
					<Comment>для проверки загруженных из 1с7 партий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/Экспертиза/Ext/ManagerModule.bsl
//// ОБРАБОТЧИКИ МОДУЛЯ ОБЪЕКТА

Процедура ВыполнитьПроведение(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_ВыполнитьПроведение";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	лКонтроль = Неопределено;
	лФильтр = Неопределено;
	ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "ДанныеОбъекта.Контроль", лКонтроль);
	ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "Фильтр", лФильтр);	

	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ТоварыНаСкладах") тогда
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ТоварыНаСкладах",
		РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
	КонецЕсли;
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ПартииТоваров") тогда
		// регистр накопления "ПартииТоваров"
		
		НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
		
		лБазовая = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров);	
		
		лРазделенныеБазовая = РаботаСПоследовательностямиКлиентСервер.РазделенныеДанные(лБазовая, лФильтр);
		лИсходная = лРазделенныеБазовая.Включенные;
		
		лТребуемая = РегистрыНакопления_ПартииТоваров(вхСсылкаНаДокумент, вхОтказ, вхПараметры, лФильтр);
				
		лРазностныеДанные = РаботаСПоследовательностямиКлиентСервер.РазностныеДанные(лИсходная, лТребуемая); 
		ПроведениеДокументовКлиентСервер.ЗаписатьДвижения(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров,
		лРазностныеДанные, лРазделенныеБазовая.Исключенные);
		
		ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
		Если лФильтр = Неопределено Тогда 
			РаботаСПоследовательностямиКлиентСервер.ЗарегистрироватьОбъектПоСсылке(вхСсылкаНаДокумент, "ПартионныйУчет", Истина);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьОтменуПроведения(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_ВыполнитьОтменуПроведения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
	ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент);
	ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
	
	РаботаСПоследовательностямиКлиентСервер.ЗарегистрироватьОбъектПоСсылке(вхСсылкаНаДокумент, "ПартионныйУчет", Ложь);
КонецПроцедуры

//// ТАБЛИЦЫ ДВИЖЕНИЙ ДОКУМЕНТОВ

Функция СформироватьТаблицуТоваровДокумента(вхСсылкаНаДокумент, вхПараметры)
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_СформироватьТаблицуТоваровДокумента";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ВидДвижения,
	|	ЭкспертизаТовары.Ссылка КАК Регистратор,
	|	ЭкспертизаТовары.Ссылка.Дата КАК Период,
	|	ЭкспертизаТовары.Ссылка.Склад КАК Склад,
	|	ЭкспертизаТовары.Номенклатура,
	|	ЭкспертизаТовары.Качество,
	|	ЭкспертизаТовары.СтрокаПрихода КАК СтрокаПрихода,
	|	ЭкспертизаТовары.Количество,
	|	ЭкспертизаТовары.СтрокаПрихода.ТорговаяТочка КАК ТорговаяТочка,
	|	ВЫБОР
	|		КОГДА ЭкспертизаТовары.Ссылка.ВалютаДокумента = &ВалютаРубль
	|			ТОГДА ЭкспертизаТовары.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРубли,
	|	ВЫБОР
	|		КОГДА ЭкспертизаТовары.Ссылка.ВалютаДокумента = &ВалютаДоллар
	|			ТОГДА ЭкспертизаТовары.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоллары,
	|	ВЫБОР
	|		КОГДА ЭкспертизаТовары.Ссылка.ВалютаДокумента = &ВалютаЕвро
	|			ТОГДА ЭкспертизаТовары.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЕвро,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный) КАК СтатусПартии,
	|	ЭкспертизаТовары.Ссылка.Организация КАК Организация,
	|	ЭкспертизаТовары.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЭкспертизаТовары.Ссылка.УчитыватьНДС
	|				И ЭкспертизаТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА ЭкспертизаТовары.Сумма - ЭкспертизаТовары.СуммаНДС
	|		ИНАЧЕ ЭкспертизаТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС
	|ИЗ
	|	Документ.Экспертиза.Товары КАК ЭкспертизаТовары
	|ГДЕ
	|	ЭкспертизаТовары.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);         
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ВалютаРубль", ПараметрыСеанса.ВалютаРубль);
	Запрос.УстановитьПараметр("ВалютаДоллар", ПараметрыСеанса.ВалютаДоллар);
	Запрос.УстановитьПараметр("ВалютаЕвро", ПараметрыСеанса.ВалютаЕвро);
	
	ТабТоваров = Запрос.Выполнить().Выгрузить();
	
	Если ТабТоваров.Количество() > 0 Тогда
		ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата");
		ВалютаДокумента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНаДокумент, "ВалютаДокумента");
		КурсДокумента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНаДокумент, "КурсВзаиморасчетов");
		КратностьДокумента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНаДокумент, "КратностьВзаиморасчетов");
		КурсДоллара = МодульВалютногоУчета.ПолучитьКурсВалюты(ПараметрыСеанса.ВалютаДоллар, ДатаДокумента);
		КурсЕвро = МодульВалютногоУчета.ПолучитьКурсВалюты(ПараметрыСеанса.ВалютаЕвро, ДатаДокумента);
		Если ВалютаДокумента = ПараметрыСеанса.ВалютаРубль Тогда
			Для Каждого Товар Из ТабТоваров Цикл
				Товар.СуммаДоллары = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.СуммаРубли, ПараметрыСеанса.ВалютаРубль,
				ПараметрыСеанса.ВалютаДоллар, 1, КурсДоллара.Курс, 1, КурсДоллара.Кратность);
				Товар.СуммаЕвро = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.СуммаРубли, ПараметрыСеанса.ВалютаРубль,
				ПараметрыСеанса.ВалютаЕвро, 1, КурсЕвро.Курс, 1, КурсЕвро.Кратность);
			КонецЦикла;
			
		ИначеЕсли ВалютаДокумента = ПараметрыСеанса.ВалютаДоллар Тогда
			Для Каждого Товар Из ТабТоваров Цикл
				Товар.СуммаРубли = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.СуммаДоллары, ПараметрыСеанса.ВалютаДоллар,
				ПараметрыСеанса.ВалютаРубль, КурсДокумента, 1, КратностьДокумента, 1);
				Товар.СуммаЕвро = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.СуммаДоллары, ПараметрыСеанса.ВалютаЕвро,
				ПараметрыСеанса.ВалютаЕвро, КурсДоллара.Курс, КурсЕвро.Курс, КурсДоллара.Кратность, КурсЕвро.Кратность);
				Товар.СуммаБезНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.СуммаБезНДС, ПараметрыСеанса.ВалютаДоллар,
				ПараметрыСеанса.ВалютаРубль, КурсДокумента, 1, КратностьДокумента, 1);
			КонецЦикла;
			
		ИначеЕсли ВалютаДокумента = ПараметрыСеанса.ВалютаЕвро Тогда
			Для Каждого Товар Из ТабТоваров Цикл
				Товар.СуммаДоллары = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.СуммаЕвро, ПараметрыСеанса.ВалютаЕвро,
				ПараметрыСеанса.ВалютаДоллар, КурсЕвро.Курс, КурсДоллара.Курс, КурсЕвро.Кратность, КурсДоллара.Кратность);
				Товар.СуммаРубли = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.СуммаЕвро, ПараметрыСеанса.ВалютаДоллар,
				ПараметрыСеанса.ВалютаРубль, КурсДокумента, 1, КратностьДокумента, 1);
				Товар.СуммаБезНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.СуммаБезНДС, ПараметрыСеанса.ВалютаДоллар,
				ПараметрыСеанса.ВалютаРубль, КурсДокумента, 1, КратностьДокумента, 1);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПроведениеДокументовКлиентСервер.ЗаписатьЗначение(вхПараметры, "ТаблицаТоваров", ТабТоваров);
	
	Возврат ТабТоваров;
	
КонецФункции

Функция РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт 
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_РегистрыНакопления_ТоварыНаСкладах";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ТоварыНаСкладах", ТаблицаДвижений);
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,ВидОперации,СтатусДокумента,Склад,ВалютаДокумента,КурсВзаиморасчетов,КратностьВзаиморасчетов,ДокументОснование,Организация,АктРассмотренияВозврата,Склад.СкладНедостач"); 
	
	//Размещенное количество приходуем на склад
	//Неразмещенное количество приходуем на склад недостач
	СкладНедостач = ОбщегоНазначения.СкладНедостач(Реквизиты.Склад);
	Если Не ЗначениеЗаполнено(СкладНедостач) Тогда
		ВызватьИсключение "Не задан склад недостач для склада "+Реквизиты.Склад;
	КонецЕсли;
	
	Если Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ЭкспертизаНовый Тогда
		Возврат ТаблицаДвижений
	КонецЕсли;
	
	Если Реквизиты.ВидОперации = Перечисления.ВидыОперацийЭкспертиза.ОтказПоставщикаВВозврате
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийЭкспертиза.ПоступлениеНаЭкспертизуОтПокупателя Тогда
		
		//Приход
		ТекстЗапроса = "ВЫБРАТЬ
		|	ЭкспертизаТоварыТовары.Ссылка,
		|	ЭкспертизаТоварыТовары.Номенклатура КАК Номенклатура,
		|	ЭкспертизаТоварыТовары.Качество КАК Качество,
		|	СУММА(ЭкспертизаТоварыТовары.КоличествоРазмещено) КАК КоличествоРазмещено,
		|	СУММА(ЭкспертизаТоварыТовары.Количество) КАК КоличествоПринято
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	Документ.Экспертиза.Товары КАК ЭкспертизаТоварыТовары
		|ГДЕ
		|	ЭкспертизаТоварыТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭкспертизаТоварыТовары.Ссылка,
		|	ЭкспертизаТоварыТовары.Номенклатура,
		|	ЭкспертизаТоварыТовары.Качество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Ссылка.Склад КАК Склад,
		|	ВТТовары.Номенклатура,
		|	ВТТовары.Качество,
		|	ВЫБОР
		|		КОГДА ВТТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЭкспертизаПринят)
		|			ТОГДА ВТТовары.КоличествоПринято
		|		ИНАЧЕ ВТТовары.КоличествоРазмещено
		|	КОНЕЦ КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВТТовары.Ссылка КАК Регистратор,
		|	ВТТовары.Ссылка.Дата КАК Период
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЭкспертизаПринят)
		|				ТОГДА ВТТовары.КоличествоПринято
		|			ИНАЧЕ ВТТовары.КоличествоРазмещено
		|		КОНЕЦ > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&СкладНедостач,
		|	ВТТовары.Номенклатура,
		|	ВТТовары.Качество,
		|	ВТТовары.КоличествоПринято - ВТТовары.КоличествоРазмещено,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ВТТовары.Ссылка,
		|	ВТТовары.Ссылка.Дата
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.КоличествоПринято > ВТТовары.КоличествоРазмещено
		|	И ВТТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЭкспертизаРазмещен)";
		
	ИначеЕсли  Реквизиты.ВидОперации = Перечисления.ВидыОперацийЭкспертиза.ПередачаНаЭкспертизуПоставщику Тогда
		
		//Расход
		ТекстЗапроса = "ВЫБРАТЬ
		|	ЭкспертизаТоварыТовары.Ссылка,
		|	ЭкспертизаТоварыТовары.Номенклатура КАК Номенклатура,
		|	ЭкспертизаТоварыТовары.Качество КАК Качество,
		|	СУММА(ЭкспертизаТоварыТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	Документ.Экспертиза.Товары КАК ЭкспертизаТоварыТовары
		|ГДЕ
		|	ЭкспертизаТоварыТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭкспертизаТоварыТовары.Ссылка,
		|	ЭкспертизаТоварыТовары.Номенклатура,
		|	ЭкспертизаТоварыТовары.Качество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Ссылка.Склад КАК Склад,
		|	ВТТовары.Номенклатура,
		|	ВТТовары.Качество,
		|	ВТТовары.Количество,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВТТовары.Ссылка КАК Регистратор,
		|	ВТТовары.Ссылка.Дата КАК Период
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0";
		
	Иначе
		Возврат ТаблицаДвижений
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("СкладНедостач", СкладНедостач);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Функция РегистрыНакопления_ПартииТоваров(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено, вхФильтр = Неопределено)
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_РегистрыНакопления_ПартииТоваров";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПартииТоваров", ТаблицаДвижений);
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,СтатусДокумента,АктРассмотренияВозврата,ВидОперации"); 
	
	Если Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ЭкспертизаНовый Тогда
		Возврат ТаблицаДвижений
	КонецЕсли;
	
	Если Реквизиты.ВидОперации = Реквизиты.ВидОперации = Перечисления.ВидыОперацийЭкспертиза.ОтказПоставщикаВВозврате
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийЭкспертиза.ПоступлениеНаЭкспертизуОтПокупателя Тогда
		
		//Приход
		ТаблицаДвижений = РегистрыНакопления_ПартииТоваров_Приход(вхСсылкаНаДокумент, вхОтказ, вхПараметры, вхФильтр);
		
	ИначеЕсли Реквизиты.ВидОперации = Перечисления.ВидыОперацийЭкспертиза.ПередачаНаЭкспертизуПоставщику Тогда
		
		//Расход
		Структура = ПроведениеДокументовКлиентСервер.ПогашениеПартийТоваровНовое(вхСсылкаНаДокумент, вхОтказ, ,вхФильтр, вхПараметры);
		Если Не вхОтказ	Тогда 			
			Для каждого Движение Из Структура.ПартииТоваров Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(), Движение);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Функция РегистрыНакопления_ПартииТоваров_Приход(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено, вхФильтр = Неопределено)
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_РегистрыНакопления_ПартииТоваров_Приход";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПартииТоваров", ТаблицаДвижений);
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,ВидОперации,СтатусДокумента,Склад,ВалютаДокумента,КурсВзаиморасчетов,КратностьВзаиморасчетов,ДокументОснование,Организация,Контрагент, АктРассмотренияВозврата"); 
	
	
	////Заполнено основание и Акт возврата
	//Если Не ЗначениеЗаполнено(Реквизиты.ДокументОснование) Тогда
	//	ВызватьИсключение "Не заполнен документ-основание!";			
	//КонецЕсли;
	
	Если Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ЭкспертизаНовый Тогда
		Возврат ТаблицаДвижений
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭкспертизаТовары.Ссылка КАК Ссылка,
	               |	ЭкспертизаТовары.Номенклатура,
	               |	ЭкспертизаТовары.Ссылка.Склад КАК Склад,
	               |	ЭкспертизаТовары.Качество,
	               |	ЭкспертизаТовары.СтрокаПрихода,
	               |	ЭкспертизаТовары.Ссылка.Организация КАК Организация,
	               |	ЭкспертизаТовары.Количество КАК КоличествоПринято,
	               |	ЭкспертизаТовары.КоличествоРазмещено КАК КоличествоРазмещено,
	               |	ЭкспертизаТовары.Сумма КАК Себестоимость,
	               |	ЭкспертизаТовары.Цена КАК СебестоимостьЦена,
	               |	ЭкспертизаТовары.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	               |	ЭкспертизаТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	ЭкспертизаТовары.СтавкаНДС,
	               |	ЭкспертизаТовары.НомерСтроки КАК НомерСтрокиВДокументе
	               |ПОМЕСТИТЬ ВТТовары
	               |ИЗ
	               |	Документ.Экспертиза.Товары КАК ЭкспертизаТовары
	               |ГДЕ
	               |	ЭкспертизаТовары.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	ВТТовары.Ссылка КАК Регистратор,
	               |	ВТТовары.Ссылка.Дата КАК Период,
	               |	ВТТовары.Номенклатура,
	               |	ВТТовары.Склад,
	               |	ВТТовары.Качество,
	               |	ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный) КАК СтатусПартии,
	               |	ВТТовары.СтрокаПрихода,
	               |	ВТТовары.Организация КАК Организация,
	               |	ВТТовары.КоличествоРазмещено КАК Количество,
	               |	ВТТовары.СебестоимостьЦена * ВТТовары.КоличествоРазмещено КАК Себестоимость,
	               |	ВТТовары.СебестоимостьЦена,
	               |	ВТТовары.УчитыватьНДС,
	               |	ВТТовары.СуммаВключаетНДС,
	               |	ВТТовары.СтавкаНДС,
	               |	ВТТовары.НомерСтрокиВДокументе,
	               |	ВТТовары.СебестоимостьЦена * ВТТовары.КоличествоРазмещено КАК СуммаРубли,
	               |	0 КАК СуммаДоллары,
	               |	0 КАК СуммаЕвро,
	               |	ВТТовары.СебестоимостьЦена * ВТТовары.КоличествоРазмещено КАК СуммаБезНДС,
	               |	ЛОЖЬ КАК ВнутреннееПеремещение,
	               |	НЕОПРЕДЕЛЕНО КАК ДокументОснование
	               |ИЗ
	               |	ВТТовары КАК ВТТовары
	               |ГДЕ
	               |	ВТТовары.КоличествоРазмещено > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	               |	ВТТовары.Ссылка,
	               |	ВТТовары.Ссылка.Дата,
	               |	ВТТовары.Номенклатура,
	               |	ВТТовары.Склад.СкладНедостач,
	               |	&КачествоНедостача,
	               |	ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный),
	               |	ВТТовары.СтрокаПрихода,
	               |	ВТТовары.Организация,
	               |	ВТТовары.КоличествоПринято - ВТТовары.КоличествоРазмещено,
	               |	ВТТовары.СебестоимостьЦена,
	               |	ВТТовары.СебестоимостьЦена * (ВТТовары.КоличествоПринято - ВТТовары.КоличествоРазмещено),
	               |	ВТТовары.УчитыватьНДС,
	               |	ВТТовары.СуммаВключаетНДС,
	               |	ВТТовары.СтавкаНДС,
	               |	ВТТовары.НомерСтрокиВДокументе,
	               |	ВТТовары.СебестоимостьЦена * (ВТТовары.КоличествоПринято - ВТТовары.КоличествоРазмещено),
	               |	0,
	               |	0,
	               |	ВТТовары.СебестоимостьЦена * (ВТТовары.КоличествоПринято - ВТТовары.КоличествоРазмещено),
	               |	ЛОЖЬ,
	               |	НЕОПРЕДЕЛЕНО
	               |ИЗ
	               |	ВТТовары КАК ВТТовары
	               |ГДЕ
	               |	ВТТовары.КоличествоПринято > ВТТовары.КоличествоРазмещено";
	
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("КачествоНедостача", Справочники.Качество.Недостача);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() > 0 Тогда 
		
		ВалютаДокумента = Реквизиты.ВалютаДокумента;
		КурсДокумента = Реквизиты.КурсВзаиморасчетов;
		КратностьДокумента = Реквизиты.КратностьВзаиморасчетов;
		
		КурсДоллара = МодульВалютногоУчета.ПолучитьКурсВалюты(ПараметрыСеанса.ВалютаДоллар, Реквизиты.Дата);
		КурсЕвро = МодульВалютногоУчета.ПолучитьКурсВалюты(ПараметрыСеанса.ВалютаЕвро, Реквизиты.Дата);
		Для Каждого Товар Из ТЗ Цикл
			Если Товар.УчитыватьНДС И Товар.СуммаВключаетНДС Тогда 
				СтНДС =  УчетНДС.ПолучитьСтавкуНДС(Товар.СтавкаНДС);
				Товар.СуммаБезНДС = 100 * Товар.СуммаБезНДС / (100 + СтНДС);
			КонецЕсли;
			Если ВалютаДокумента = ПараметрыСеанса.ВалютаРубль Тогда
				Товар.СуммаДоллары = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.Себестоимость, ПараметрыСеанса.ВалютаРубль,
				ПараметрыСеанса.ВалютаДоллар, 1, КурсДоллара.Курс, 1, КурсДоллара.Кратность);
				Товар.СуммаЕвро = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.Себестоимость, ПараметрыСеанса.ВалютаРубль,
				ПараметрыСеанса.ВалютаЕвро, 1, КурсЕвро.Курс, 1, КурсЕвро.Кратность);
			ИначеЕсли ВалютаДокумента = ПараметрыСеанса.ВалютаДоллар Тогда
				Товар.СуммаРубли = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.Себестоимость, ПараметрыСеанса.ВалютаДоллар,
				ПараметрыСеанса.ВалютаРубль, КурсДокумента, 1, КратностьДокумента, 1);
				Товар.СуммаЕвро = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.Себестоимость, ПараметрыСеанса.ВалютаЕвро,
				ПараметрыСеанса.ВалютаЕвро, КурсДоллара.Курс, КурсЕвро.Курс, КурсДоллара.Кратность, КурсЕвро.Кратность);
				Товар.СуммаБезНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.СуммаБезНДС, ПараметрыСеанса.ВалютаДоллар,
				ПараметрыСеанса.ВалютаРубль, КурсДокумента, 1, КратностьДокумента, 1);
			ИначеЕсли ВалютаДокумента = ПараметрыСеанса.ВалютаЕвро Тогда
				Товар.СуммаДоллары = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.Себестоимость, ПараметрыСеанса.ВалютаЕвро,
				ПараметрыСеанса.ВалютаДоллар, КурсЕвро.Курс, КурсДоллара.Курс, КурсЕвро.Кратность, КурсДоллара.Кратность);
				Товар.СуммаРубли = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.Себестоимость, ПараметрыСеанса.ВалютаДоллар,
				ПараметрыСеанса.ВалютаРубль, КурсДокумента, 1, КратностьДокумента, 1);
				Товар.СуммаБезНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Товар.СуммаБезНДС, ПараметрыСеанса.ВалютаДоллар,
				ПараметрыСеанса.ВалютаРубль, КурсДокумента, 1, КратностьДокумента, 1);
			КонецЕсли;
			
			
			ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(), Товар);
			
		КонецЦикла;
	КонецЕсли;
	
		
	Возврат ТаблицаДвижений;
	
КонецФункции

Функция ТаблицыДляРасчетаСписанияПоПартиям(вхСсылкаНаДокумент, вхФильтр = Неопределено) Экспорт
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_ТаблицыДляРасчетаСписанияПоПартиям";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭкспертизаТовары.Номенклатура КАК Номенклатура,
	               |	ЭкспертизаТовары.Ссылка.Склад КАК Склад,
	               |	ЭкспертизаТовары.Качество,
	               |	ЭкспертизаТовары.СтрокаПрихода КАК СтрокаПрихода,
	               |	ЭкспертизаТовары.СтрокаПрихода = &ПустаяСтрокаПрихода КАК ПустаяСтрокаПрихода,
	               |	ВЫБОР
	               |		КОГДА ЭкспертизаТовары.Ссылка.Склад.СкладVMI
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
	               |	КОНЕЦ КАК СтатусПартии,
	               |	ЭкспертизаТовары.Количество КАК Количество,
	               |	""Cписание"" КАК ВидСписания,
	               |	ЭкспертизаТовары.Ссылка.Склад.СкладVMI КАК ОприходоватьПоVMI,
	               |	ЭкспертизаТовары.Ссылка.Организация КАК Организация,
	               |	ЭкспертизаТовары.НомерСтроки КАК НомерСтрокиВДокументе
	               |ИЗ
	               |	Документ.Экспертиза.Товары КАК ЭкспертизаТовары
	               |ГДЕ
	               |	ЭкспертизаТовары.Ссылка = &Ссылка";
	Если ТипЗнч(вхФильтр) = Тип("Структура") и вхФильтр.Свойство("Номенклатура") Тогда 
		Запрос.Текст = Запрос.Текст + " И СписаниеТоваровТовары.Номенклатура = &Номенклатура";
		Запрос.УстановитьПараметр("Номенклатура", вхФильтр.Номенклатура);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПустаяСтрокаПрихода", Справочники.ИдентификаторыСтрокПриходов.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьМетаданные()
	Возврат Метаданные.Документы.Экспертиза;
КонецФункции

Функция ПолучитьРеквизитыКонтроля(вхПараметр = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Если (вхПараметр = Метаданные.ПланыОбмена.ОбменПартКом83_77) тогда
		Результат = ОбменДаннымиКлиентСервер.РеквизитыКонтроляПоДокументу(ПолучитьМетаданные(), ИсключаемыеРеквизитыКонтроляРегистрации());
	Иначе
		Результат.Вставить("Шапка", "Дата,Проведен");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначенияРеквизитовКонтроля(вхСсылкаНаОбъект, вхПараметр = Неопределено) Экспорт
	Возврат	РаботаСПоследовательностямиКлиентСервер.ПолучитьЗначенияРеквизитовКонтроля(вхСсылкаНаОбъект, вхПараметр);
КонецФункции

Функция ИсключаемыеРеквизитыКонтроляРегистрации() Экспорт
	
	ИсключаемыеРеквизиты = ОбменДаннымиКлиентСервер.ИнициализироватьТаблицуИсключаемыхРеквизитовКонтроля();
	ОбменДаннымиКлиентСервер.ДобавитьВИсключаемыеРевизиты(ИсключаемыеРеквизиты, "Ссылка");
	
	Возврат ИсключаемыеРеквизиты;
	
КонецФункции

Функция ПолучитьДанныеГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхФильтр = Неопределено) Экспорт
	
	Результат = Неопределено;
	лМетаданныеПоследовательности = Неопределено;
	Если (ТипЗнч(вхПоследовательность) = Тип("Строка")) тогда
		лМетаданныеПоследовательности = Метаданные.Последовательности.Найти(вхПоследовательность);
	ИначеЕсли (ТипЗнч(вхПоследовательность) = Тип("ОбъектМетаданных")) И Метаданные.Последовательности.Содержит(вхПоследовательность) тогда
		лМетаданныеПоследовательности = вхПоследовательность;
	КонецЕсли;
	
	Если (лМетаданныеПоследовательности = Неопределено) тогда
		ВызватьИсключение "[ПолучитьДанныеГраницПоследовательности]: неправильный параметр номер 2.";	
	КонецЕсли;
	
	Если (лМетаданныеПоследовательности = Метаданные.Последовательности.ПартионныйУчет) Тогда
		Результат = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(вхСсылкаНаДокумент,
		Метаданные.РегистрыНакопления.ПартииТоваров, вхФильтр);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры = Неопределено)
	РаботаСПоследовательностямиКлиентСервер.НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры);	
КонецПроцедуры

Процедура ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры = Неопределено)
	РаботаСПоследовательностямиКлиентСервер.ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры);	
КонецПроцедуры

Функция ПолучитьЗаписиПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, Проведение) Экспорт 
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_ПолучитьЗаписиПоследовательности";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	лМетаданныеПоследовательности = Неопределено;	
	Если (ТипЗнч(вхПоследовательность) = Тип("Строка")) тогда
		лМетаданныеПоследовательности = Метаданные.Последовательности.Найти(вхПоследовательность);
	ИначеЕсли (ТипЗнч(вхПоследовательность) = Тип("ОбъектМетаданных")) И Метаданные.Последовательности.Содержит(вхПоследовательность) тогда
		лМетаданныеПоследовательности = вхПоследовательность;
	КонецЕсли;
	
	Если (лМетаданныеПоследовательности = Неопределено) тогда
		ВызватьИсключение "[ПолучитьДанныеДляПоследовательности]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лМетаданныеДокумента = вхСсылкаНаДокумент.Метаданные();
	Если НЕ лМетаданныеПоследовательности.Документы.Содержит(лМетаданныеДокумента) тогда
		ВызватьИсключение "[ПолучитьДанныеДляПоследовательности]: неправильный параметр номер 1.";
	КонецЕсли;
	
	//лЭтоОтменаПроведения = Ложь;
	//лРежимЗаписи = Неопределено;
	//Если ЭтотОбъект.ДополнительныеСвойства.Свойство("РежимЗаписи", лРежимЗаписи) тогда
	//	лЭтоОтменаПроведения = (лРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения);
	//КонецЕсли;
	Дата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата");
	лРезультат = ОбщегоНазначения.СоздатьСтруктуруПоследовательности(лМетаданныеПоследовательности);
	Если (лМетаданныеПоследовательности = Метаданные.Последовательности.ПартионныйУчет) тогда
		Если Проведение                                                                         
			И Дата >= ПараметрыСеанса.ДатаНачалаРаботыТовары 
			И Дата >= глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ЭкспертизаТовары.Ссылка.Дата КАК Период,
			               |	ЭкспертизаТовары.Ссылка КАК Регистратор,
			               |	ЭкспертизаТовары.Номенклатура КАК Номенклатура
			               |ИЗ
			               |	Документ.Экспертиза.Товары КАК ЭкспертизаТовары
			               |ГДЕ
			               |	ЭкспертизаТовары.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл 
				ЗаполнитьЗначенияСвойств(лРезультат.Добавить(), Выборка); 
			КонецЦикла;
			
		КонецЕсли;
		
		Результат = ПроведениеДокументовКлиентСервер.ПолучитьМоментыВремени(лМетаданныеПоследовательности, лРезультат);
		
	Иначе
		
		ВызватьИсключение "[ПолучитьЗаписиПоследовательности]: неправильный параметр номер 1.";
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_ОбработкаПолученияПредставления";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////////
	
	Если ЗначениеЗаполнено(Данные.ВидОперации) Тогда 
		СтандартнаяОбработка 	= Ложь;
		Представление 			= СтрШаблон(НСтр("ru = '%1 %2 от %3'"), Данные.ВидОперации, СокрЛП(Данные.Номер), Данные.Дата);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_ОбработкаПолученияПолейПредставления";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////////
	
	Поля.Добавить("ВидОперации");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

//// ОБМЕНЫ

//Выгрузка
Функция ВыгрузитьЭлементы(вхТаблицаСсылокНаОбъекты, вхПланОбмена) Экспорт
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_ВыгрузитьЭлементы";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	Результат = Новый Массив;
	
	лМетаданныеПланаОбмена = Неопределено;
	лТип = ТипЗнч(вхПланОбмена);
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(вхПланОбмена);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.ПланыОбмена.Содержит(вхПланОбмена) тогда
		лМетаданныеПланаОбмена = вхПланОбмена;
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Неопределено) тогда
		ВызватьИсключение "[ВыгрузитьЭлементы]: неправильный параметр номер 2.";
	КонецЕсли;
	
	Если лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog Тогда 
		
		лМенеджерПланаОбмена = ПланыОбмена[лМетаданныеПланаОбмена.Имя];
		
		лЗапрос = Новый Запрос;
		лЗапрос.УстановитьПараметр("ТаблицаСсылок", вхТаблицаСсылокНаОбъекты);
		лЗапрос.УстановитьПараметр("ПустаяЗаявка", Документы.ЗаявкаПокупателя.ПустаяСсылка());
		лЗапрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Ссылка
		|ПОМЕСТИТЬ Объекты
		|ИЗ
		|	&ТаблицаСсылок КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭкспертизаТовары.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.КодВозврата.Код, """") КАК КодВозврата,
		|	ЕСТЬNULL(ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.Штрихкод, """") КАК Штрихкод,
		|	ЭкспертизаТовары.Ссылка.Склад.ФизическийСклад КАК Склад,
		|	ЭкспертизаТовары.Ссылка.Номер КАК Номер,
		|	ЭкспертизаТовары.Ссылка.Дата КАК Дата,
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.Номер КАК НомерВходящегоДокумента,
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.Дата КАК ДатаВходящегоДокумента,
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.Номер КАК НомерВходящегоСФ,
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.Дата КАК ДатаВходящегоСФ,
		|	ЭкспертизаТовары.Ссылка.СуммаДокумента КАК СуммаДокумента,
		|	ЕСТЬNULL(ЭкспертизаТовары.Ссылка.Контрагент.ОсновнаяТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)) КАК Контрагент,
		|	ЭкспертизаТовары.Ссылка.Организация КАК Организация,
		|	ЕСТЬNULL(ЭкспертизаТовары.Ссылка.Склад.СкладVMI, ЛОЖЬ) КАК ОтветХранение,
		|	ЭкспертизаТовары.Номенклатура,
		|	ЭкспертизаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ЭкспертизаТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	ЭкспертизаТовары.Цена,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаЗаявки.ПрайсПоставщика.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК СкладПолучатель,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаЗаявки.IDSite, """") КАК SSID,
		|	ЕСТЬNULL(ЭкспертизаТовары.Ссылка.Контрагент.ОсновнаяТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)) КАК Клиент,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаЗаявки.ПоследняяКорректировка.ТорговаяТочка.Город, ЕСТЬNULL(ЭкспертизаТовары.СтрокаЗаявки.Заявка.ТорговаяТочка.Город, ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка))) КАК Город,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаПрихода.НомерГТД.Представление, """") КАК ГТД,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаПрихода.СтранаПроисхождения.Код, """") КАК СтранаКод,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаПрихода.СтранаПроисхождения.Наименование, """") КАК СтранаНаименование,
		|	ЭкспертизаТовары.КоличествоПлан КАК Количество,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка КАК Виртуальная,
		|	ЛОЖЬ КАК КроссСток,
		|	"""" КАК КлиентНаименование,
		|	ЛОЖЬ КАК ЭтоЮридическоеЛицо
		|ИЗ
		|	Документ.Экспертиза.Товары КАК ЭкспертизаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Объекты КАК Объекты
		|		ПО ЭкспертизаТовары.Ссылка = Объекты.Ссылка
		|ГДЕ
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|	И ЭкспертизаТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЭкспертизаНовый)
		|	И ЭкспертизаТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЭкспертиза.ПередачаНаЭкспертизуПоставщику)
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭкспертизаТовары.Ссылка КАК Ссылка,
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.Штрихкод КАК Штрихкод,
		|	ЕСТЬNULL(ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.КодВозврата.Код, """") КАК КодВозврата,
		|	ЭкспертизаТовары.Ссылка.Склад.ФизическийСклад КАК Склад,
		|	ЭкспертизаТовары.Ссылка.Номер КАК Номер,
		|	ЭкспертизаТовары.Ссылка.Дата КАК Дата,
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.Номер КАК НомерВходящегоДокумента,
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.Дата КАК ДатаВходящегоДокумента,
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.Номер КАК НомерВходящегоСФ,
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата.Дата КАК ДатаВходящегоСФ,
		|	ЭкспертизаТовары.Ссылка.СуммаДокумента КАК СуммаДокумента,
		|	ЕСТЬNULL(ЭкспертизаТовары.Ссылка.Контрагент.ОсновнаяТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)) КАК Контрагент,
		|	ЭкспертизаТовары.Ссылка.Организация КАК Организация,
		|	ЕСТЬNULL(ЭкспертизаТовары.Ссылка.Склад.СкладVMI, ЛОЖЬ) КАК ОтветХранение,
		|	ЭкспертизаТовары.Номенклатура,
		|	ЭкспертизаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ЭкспертизаТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	ЭкспертизаТовары.Цена,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаЗаявки.ПрайсПоставщика.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК СкладПолучатель,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаЗаявки.IDSite, """") КАК SSID,
		|	ЕСТЬNULL(ЭкспертизаТовары.Ссылка.Контрагент.ОсновнаяТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)) КАК Клиент,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаЗаявки.ПоследняяКорректировка.ТорговаяТочка.Город, ЕСТЬNULL(ЭкспертизаТовары.СтрокаЗаявки.Заявка.ТорговаяТочка.Город, ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка))) КАК Город,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаПрихода.НомерГТД.Представление, """") КАК ГТД,
		|	ЭкспертизаТовары.КоличествоПлан КАК Количество,
		|	ЕСТЬNULL(ЭкспертизаТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка КАК Виртуальная
		|ИЗ
		|	Документ.Экспертиза.Товары КАК ЭкспертизаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Объекты КАК Объекты
		|		ПО ЭкспертизаТовары.Ссылка = Объекты.Ссылка
		|ГДЕ
		|	ЭкспертизаТовары.Ссылка.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|	И ЭкспертизаТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЭкспертизаНовый)
		|	И (ЭкспертизаТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЭкспертиза.ПоступлениеНаЭкспертизуОтПокупателя)
		|			ИЛИ ЭкспертизаТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЭкспертиза.ОтказПоставщикаВВозврате))
		|ИТОГИ ПО
		|	Ссылка";
		
		РезультатыЗапроса = лЗапрос.ВыполнитьПакет();
		
		РезультатЗапросаПриемка = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1];
		РезультатЗапросаОтгрузка = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2];
		
		//Заказы на приемку
		Если НЕ РезультатЗапросаПриемка.Пустой() Тогда
			лТипОбъектаXDTO = ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ЗаказНаПриемку");
			лВыборка = РезультатЗапросаПриемка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
			
			Пока лВыборка.Следующий() Цикл
				
				лОбъект = ФабрикаXDTO.Создать(лТипОбъектаXDTO);
				ЗаполнитьЗначенияСвойств(лОбъект, лВыборка, "Номер,Дата,НомерВходящегоДокумента,ДатаВходящегоДокумента,НомерВходящегоСФ,ДатаВходящегоСФ,СуммаДокумента,ОтветХранение");
				лОбъект.ВидДокумента 		= "Экспертиза";
				лОбъект.Ссылка 				= XMLСтрока(лВыборка.Ссылка);
				лОбъект.СкладСсылка 		= XMLСтрока(лВыборка.Склад);
				лОбъект.КонтрагентСсылка 	= XMLСтрока(лВыборка.Контрагент);
				лОбъект.ОрганизацияСсылка 	= XMLСтрока(лВыборка.Организация);
				лОбъект.ШтрихКод 			= XMLСтрока(лВыборка.ШтрихКод);
				лОбъект.КодВозврата 		= XMLСтрока(лВыборка.КодВозврата);
				
				лТовары = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ЗаказНаПриемку.Товары"));
				лТоварыСписок = лТовары.ПолучитьСписок("СтрокаТовары");
				
				ВыборкаПоТоварам = лВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ТТПополнениеСклада = Неопределено;
				
				Пока ВыборкаПоТоварам.Следующий() Цикл
					НоваяСтрока = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), лТоварыСписок.ВладеющееСвойство.Тип.Имя)); 
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоТоварам, "НоменклатураНаименование,НоменклатураАртикул,SSID,Количество,Цена,ГТД");
					НоваяСтрока.НоменклатураСсылка = XMLСтрока(ВыборкаПоТоварам.Номенклатура);
					НоваяСтрока.КлиентСсылка = XMLСтрока(ВыборкаПоТоварам.Клиент);
					НоваяСтрока.ГородСсылка = XMLСтрока(ВыборкаПоТоварам.Город);
					НоваяСтрока.СкладПолучательСсылка = XMLСтрока(ВыборкаПоТоварам.Склад);
					
					лТоварыСписок.Добавить(НоваяСтрока);
					
				КонецЦикла;	
				
				лОбъект.Товары = лТовары;
				Результат.Добавить(лОбъект);
				//Семенов И.П. 07.02.2019 XX-1768(
				ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(лВыборка.Ссылка, лОбъект, УправлениеСвойствамиПовтИсп.ЗаказНаПриемку());
				//)Семенов И.П
			КонецЦикла;

		КонецЕсли;
		
		РеквизитыМаршрутаКлиентскогоВозврата =  ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Справочники.МаршрутыДоставки.КлиентскийВозвратПоставщику, "Код, Наименование");
		
		//Заказы на отгрузку
		Если НЕ РезультатЗапросаОтгрузка.Пустой() Тогда
			лТипОбъектаXDTO = ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ЗаказНаОтгрузку");
			лВыборка = РезультатЗапросаОтгрузка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
			
			Пока лВыборка.Следующий() Цикл
				
				лОбъект = ФабрикаXDTO.Создать(лТипОбъектаXDTO);
				ЗаполнитьЗначенияСвойств(лОбъект, лВыборка, "Номер,Дата,Штрихкод,СуммаДокумента");
				лОбъект.ВидДокумента 		= "Экспертиза";
				лОбъект.Ссылка 				= XMLСтрока(лВыборка.Ссылка);
				лОбъект.СкладСсылка 		= XMLСтрока(лВыборка.Склад);
				лОбъект.КонтрагентСсылка 	= XMLСтрока(лВыборка.Контрагент);
				лОбъект.ОрганизацияСсылка 	= XMLСтрока(лВыборка.Организация);
				лОбъект.ШтрихКод 			= XMLСтрока(лВыборка.ШтрихКод);
				лОбъект.ТипДоставки 		= "";
//				лОбъект.КодВозврата 		= XMLСтрока(лВыборка.КодВозврата);
				
				ОбменДаннымиКлиентСервер.ДополнитьДаннымиПоПечати(лОбъект, лВыборка.Ссылка);
				
				лОбъект.ШтрихкодТОРГ12      = XMLСтрока(лВыборка.ШтрихКод);
				лОбъект.МаршрутДоставкиКод = РеквизитыМаршрутаКлиентскогоВозврата.Код;
				лОбъект.МаршрутДоставкиСФ = РеквизитыМаршрутаКлиентскогоВозврата.Наименование;
				
				лОбъект.ДокументОснованиеСсылка = "";
				
				лТовары = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ЗаказНаОтгрузку.Товары"));
				лТоварыСписок = лТовары.ПолучитьСписок("СтрокаТовары");
				
				ВыборкаПоТоварам = лВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ТТПополнениеСклада = Неопределено;
				
				Пока ВыборкаПоТоварам.Следующий() Цикл
					НоваяСтрока = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), лТоварыСписок.ВладеющееСвойство.Тип.Имя)); 
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоТоварам, "НоменклатураНаименование,НоменклатураАртикул,SSID,Количество,Цена,ГТД,КроссСток,КлиентНаименование,ЭтоЮридическоеЛицо,СтранаКод,СтранаНаименование");
					НоваяСтрока.НоменклатураСсылка = XMLСтрока(ВыборкаПоТоварам.Номенклатура);
					НоваяСтрока.КлиентСсылка = XMLСтрока(ВыборкаПоТоварам.Клиент);
					//НоваяСтрока.ГородСсылка = XMLСтрока(ВыборкаПоТоварам.Город);
					//НоваяСтрока.СкладПолучательСсылка = XMLСтрока(ВыборкаПоТоварам.Склад);
					
					лТоварыСписок.Добавить(НоваяСтрока);
					
				КонецЦикла;	
				
				лОбъект.Товары = лТовары;
				Результат.Добавить(лОбъект);
				//Семенов И.П. 07.02.2019 XX-1768(
				ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(лВыборка.Ссылка, лОбъект, УправлениеСвойствамиПовтИсп.ЗаказНаОтгрузку());
				//)Семенов И.П
			КонецЦикла;

		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Загрузка
Процедура ЗагрузитьЭлемент(ОбъектXDTO, вхОтправитель, Отказ, вхПараметры = Неопределено, СтруктураОтчета = Неопределено) Экспорт // 26.03.19 Строганов Роман > Убираю лишний параметр (5) - НомерСообщения = 0. Он инициализирован в структуре «вхПараметры» 
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_ЗагрузитьЭлемент";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	лМетаданныеПланаОбмена = Метаданные.НайтиПоТипу(ТипЗнч(вхОтправитель));
	
	Если лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog Тогда
		НомерПотока = ?(лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog, 0, 1);
		Попытка
			
			ИмяТипаОбъекта =  ОбъектXDTO.Тип().Имя;
			
			Если ИмяТипаОбъекта = "РезультатПриемки" Тогда
				ЗагрузитьРезультатПриемки(ОбъектXDTO, вхПараметры, СтруктураОтчета);
			ИначеЕсли ОбъектXDTO.Тип().Имя = "РезультатСборки" Тогда 
				ЗагрузитьРезультатСборки(ОбъектXDTO, вхПараметры, СтруктураОтчета);
			Иначе 
				ВызватьИсключение "Загрузка отказа поставщика в возврате для вида объекта "+ИмяТипаОбъекта+" не поддерживается!";
			КонецЕсли;
			
		Исключение
			СтруктураОшибки = Новый Структура;
			СтруктураОшибки.Вставить("ОбъектXDTO", ИмяТипаОбъекта);
			СтруктураОшибки.Вставить("GUID", ОбъектXDTO.ЗаказСсылка);
			СтруктураОшибки.Вставить("ИмяОбъектаМетаданных", "Экспертиза");
			СтруктураОшибки.Вставить("СообщениеОбОшибке", ОписаниеОшибки());
			СтруктураОшибки.Вставить("НомерСообщения", вхПараметры.НомерСообщения);
			СтруктураОшибки.Вставить("ДатаЗагрузкиСообщения", ТекущаяДата());
			СтруктураОшибки.Вставить("НомерПотока", ?(лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog, 0, 1));
			ОбменДаннымиКлиентСервер.ЗаписатьОшибкиПриОбменеСТопЛог(СтруктураОшибки);
			
			ДокСсылка = Документы.Экспертиза.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗаказСсылка));
			Если НЕ ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(ДокСсылка) Тогда 
				РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокСсылка, вхПараметры.НомерСообщения, Истина, "Ошибка загрузки: "+ОписаниеОшибки(), , Ложь, НомерПотока); 
			КонецЕсли;
			//Семенов И.П. 06.02.2019 XX-1768(
			ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокСсылка, ОбъектXDTO, , Истина, СтруктураОшибки.СообщениеОбОшибке);
			//)Семенов И.П.
			
			// 25.03.19 Строганов Роман > 
			ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокСсылка, Истина, Истина, СтруктураОшибки.СообщениеОбОшибке);
			// 25.03.19 Строганов Роман <
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьРезультатСборки(ОбъектXDTO, ДопПараметры = Неопределено, СтруктураОтчета = Неопределено)
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_ЗагрузитьРезультатСборки";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если ЗначениеЗаполнено(ОбъектXDTO.ЗаказСсылка) Тогда 
		ДокСсылка = Документы.Экспертиза.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗаказСсылка));
		
		Если ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(ДокСсылка) Тогда 
			ВызватьИсключение "Не найдена Экспериза с guid = " + ОбъектXDTO.ЗаказСсылка;
		КонецЕсли;
	Иначе
		ДокСсылка = Документы.ВозвратТоваровОтПокупателя.НайтиПоНомеру(ОбщегоНазначения.ПреобразоватьНомер(ОбъектXDTO.ЗаказНомер), ТекущаяДата());
		Если Не ЗначениеЗаполнено(ДокСсылка) Тогда 
			ВызватьИсключение "Не найдена Экспертиза с номером = " + ОбъектXDTO.ЗаказНомер;
		КонецЕсли;
	КонецЕсли;
	
	СтатусДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка, "СтатусДокумента");
	
	//Загружаем сборку только для документа в статусе Новый
	Если НЕ СтатусДокумента = Справочники.СтатусыДокументов.ЭкспертизаНовый Тогда
		Возврат;
	КонецЕсли;

	//Результат сборки топлог присылает один раз, когда все собрали и отгрузили
	
	Дата = ТекущаяДата();
	
	ТоварыXDTO = ОбъектXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	
	ТоварыВМС = Новый ТаблицаЗначений;
	ТоварыВМС.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	ТоварыВМС.Колонки.Добавить("Факт", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		НоваяСтрока = ТоварыВМС.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары, "Факт");
	КонецЦикла;
	
	ТоварыВМС.Свернуть("Номенклатура", "Факт");
	
	ДокументОбъект = ДокСсылка.ПолучитьОбъект();
	
	ТоварыСтарые 	= ДокументОбъект.Товары.Выгрузить();
	ТоварыНовые 	= ТоварыСтарые.СкопироватьКолонки();
	
	Для каждого стрТовары Из ТоварыВМС Цикл
		
		СтруктураОтбора = Новый Структура("Номенклатура");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, стрТовары);
		
		СтрокиОстатка = ТоварыСтарые.НайтиСтроки(СтруктураОтбора);
		
		Распределить = стрТовары.Количество;
		
		Если СтрокиОстатка.Количество() = 0 Тогда
			ВызватьИсключение "Не найдена строка с номенклатурой "+СтруктураОтбора.Номенклатура;
		КонецЕсли;
		
		Для каждого СтрокаОстатка Из СтрокиОстатка Цикл
			
			Распределено = Мин(Распределить, СтрокаОстатка.КоличествоПлан);
			Если Распределено < 0 Тогда
				Продолжить;
			КонецЕсли;
			
			
			НоваяСтрока = ТоварыНовые.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатка);
			НоваяСтрока.Количество = Распределено;
			
			Распределить = Распределить - Распределено;
			СтрокаОстатка.Количество = СтрокаОстатка.Количество - Распределено;
			
		КонецЦикла;
		
		Если Распределить > 0 Тогда
			//Остаток кидаем на последнюю строку
			НоваяСтрока.Количество = НоваяСтрока.Количество + Распределить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТоварыНовые.Количество() = 0 Тогда
		//очистим принятое
		Для каждого Стр Из ДокументОбъект.Товары Цикл
			Стр.Количество = 0;
		КонецЦикла;
	Иначе
		ДокументОбъект.Товары.Загрузить(ТоварыНовые);
	КонецЕсли;
	
	ДокументОбъект.ПересчитатьСуммуТабличнойЧасти();
	ДокументОбъект.Дата = Дата;
	ДокументОбъект.ПометкаУдаления = Ложь;
	
	ДокументОбъект.ОбновленИзТопЛог = Истина;
	
	ДокументОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ЭкспертизаОтгружен;
	
	Попытка
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		НомерСообщения = ?(ДопПараметры = Неопределено, 0, ДопПараметры.НомерСообщения);
		НомерПотока = ?(ДопПараметры = Неопределено, 0, ДопПараметры.НомерПотока);
		РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокументОбъект.Ссылка, НомерСообщения, , , , Ложь, НомерПотока); 
		//Семенов И.П. 06.02.2019 XX-1768(
		ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокументОбъект.Ссылка, ОбъектXDTO);
		//)Семенов И.П.
		
		// 25.03.19 Строганов Роман > 
		ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокументОбъект.Ссылка, Истина, Ложь);
		// 25.03.19 Строганов Роман <
		
	Исключение
		//ДокументОбъект.СтатусДокумента = СтарыйСтатус;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		Набор = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
		Набор.Отбор.СсылкаНаДокумент.Установить(ДокументОбъект.Ссылка);
		Стр = Набор.Добавить();
		Стр.СсылкаНаДокумент = ДокументОбъект.Ссылка;
		Набор.Записать();
		
		ВызватьИсключение ОписаниеОшибки();
		
	КонецПопытки;

КонецПроцедуры

Процедура ЗагрузитьРезультатПриемки(ОбъектXDTO, ДопПараметры = Неопределено, СтруктураОтчета = Неопределено)
	
	лКлючАлгоритма = "Документ_Экспертиза_МодульМенеджера_ЗагрузитьРезультатПриемки";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если ЗначениеЗаполнено(ОбъектXDTO.ЗаказСсылка) Тогда 
		ДокСсылка = Документы.Экспертиза.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗаказСсылка));
		
		Если ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(ДокСсылка) Тогда 
			ВызватьИсключение "Не найдена Экспериза с guid = " + ОбъектXDTO.ЗаказСсылка;
		КонецЕсли;
	Иначе
		ДокСсылка = Документы.ВозвратТоваровОтПокупателя.НайтиПоНомеру(ОбщегоНазначения.ПреобразоватьНомер(ОбъектXDTO.ЗаказНомер), ТекущаяДата());
		Если Не ЗначениеЗаполнено(ДокСсылка) Тогда 
			ВызватьИсключение "Не найдена Экспертиза с номером = " + ОбъектXDTO.ЗаказНомер;
		КонецЕсли;
	КонецЕсли;
	
	СтатусДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка, "СтатусДокумента");
	
	//Загружаем приемку только для документа в статусе Новый
	Если НЕ СтатусДокумента = Справочники.СтатусыДокументов.ЭкспертизаНовый Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьВходящее = РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.ЕстьСообщениеПоОбъекту(ДокСсылка, Ложь);
	
	Если Не ЕстьВходящее Тогда 
		//Первая приемка
		Дата = ТекущаяДата();
	Иначе
		Дата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка, "Дата");
	КонецЕсли;
	
	ТоварыXDTO = ОбъектXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	СоотвSSID = ОбменДаннымиКлиентСервер.СоответствиеСтрокЗаявокИSSID(ТоварыXDTO, ДокСсылка);
	
	ТоварыВМС = Новый ТаблицаЗначений;
	ТоварыВМС.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	ТоварыВМС.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	ТоварыВМС.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	ПричинаОтказаНаименованиеТопЛог = "";
	
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовары.Качество) Тогда
			ПричинаОтказаНаименованиеТопЛог = СтрокаТовары.Качество;			
		КонецЕсли;
		
		Если СтрокаТовары.ЭтоБрак Тогда 
			Продолжить;
		КонецЕсли;

		СтрокаЗаявки = ОбменДаннымиКлиентСервер.НайтиСтрокуЗаявкиВСоответствии(СоотвSSID, СтрокаТовары.SSID);
		
		Если Не ЗначениеЗаполнено(СтрокаЗаявки) Тогда 
			ВызватьИсключение "Не найдена строка заявки с IDSite = " + СтрокаТовары.SSID;
		Иначе
			НоваяСтрока = ТоварыВМС.Добавить();
			НоваяСтрока.СтрокаЗаявки = СтрокаЗаявки;
		КонецЕсли;
		
		НоваяСтрока.Количество = СтрокаТовары.КоличествоПринято;
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
		
	КонецЦикла;
	
	ТоварыВМС.Свернуть("Номенклатура,СтрокаЗаявки", "Количество");
	
	ДокументОбъект = ДокСсылка.ПолучитьОбъект();
	
	ТоварыСтарые 	= ДокументОбъект.Товары.Выгрузить();
	ТоварыНовые 	= ТоварыСтарые.СкопироватьКолонки();
	
	Для каждого стрТовары Из ТоварыВМС Цикл
		
		СтруктураОтбора = Новый Структура("Номенклатура,СтрокаЗаявки");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, стрТовары);
		
		СтрокиОстатка = ТоварыСтарые.НайтиСтроки(СтруктураОтбора);
		
		Распределить = стрТовары.Количество;
		
		Если СтрокиОстатка.Количество() = 0 Тогда
			ВызватьИсключение "Не найдена строка с номенклатурой "+СтруктураОтбора.Номенклатура+", строкой заявки " + СтруктураОтбора.СтрокаЗаявки;
		КонецЕсли;
		
		Для каждого СтрокаОстатка Из СтрокиОстатка Цикл
			
			Распределено = Мин(Распределить, СтрокаОстатка.КоличествоПлан);
			Если Распределено < 0 Тогда
				Продолжить;
			КонецЕсли;
			
			
			НоваяСтрока = ТоварыНовые.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатка);
			НоваяСтрока.Количество = Распределено;
			
			Распределить = Распределить - Распределено;
			СтрокаОстатка.Количество = СтрокаОстатка.Количество - Распределено;
			
		КонецЦикла;
		
		Если Распределить > 0 Тогда
			//Остаток кидаем на последнюю строку
			НоваяСтрока.Количество = НоваяСтрока.Количество + Распределить;
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если ТоварыНовые.Количество() = 0 Тогда
		//очистим принятое
		Для каждого Стр Из ДокументОбъект.Товары Цикл
			Стр.Количество = 0;
		КонецЦикла;
	Иначе
		ДокументОбъект.Товары.Загрузить(ТоварыНовые);
	КонецЕсли;
	ДокументОбъект.ПересчитатьСуммуТабличнойЧасти();
	ДокументОбъект.Дата = Дата;
	ДокументОбъект.ПометкаУдаления = Ложь;
	
	СкладВСообщении = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.СкладСсылка));
	Если Не ЗначениеЗаполнено(СкладВСообщении.СкладВозвратов) Тогда
		ВызватьИсключение "Для склада "+СкладВСообщении+" не указан склад возврата!";
	Иначе
		ДокументОбъект.Склад = СкладВСообщении.СкладВозвратов;
	КонецЕсли;
	
	СтарыйСтатус = СтатусДокумента;
	
	ДокументОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ЭкспертизаПринят;
	
	ДокументОбъект.ОбновленИзТопЛог = Истина;
	
	Попытка
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		НомерСообщения = ?(ДопПараметры = Неопределено, 0, ДопПараметры.НомерСообщения);
		НомерПотока = ?(ДопПараметры = Неопределено, 0, ДопПараметры.НомерПотока);
		РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокументОбъект.Ссылка, НомерСообщения, , , , Ложь, НомерПотока); 
		//Семенов И.П. 06.02.2019 XX-1768(
		ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокументОбъект.Ссылка, ОбъектXDTO);
		//)Семенов И.П.
		
		// 25.03.19 Строганов Роман > 
		ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокументОбъект.Ссылка, Истина, Ложь);
		// 25.03.19 Строганов Роман <
	Исключение
		//ДокументОбъект.СтатусДокумента = СтарыйСтатус;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		Набор = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
		Набор.Отбор.СсылкаНаДокумент.Установить(ДокументОбъект.Ссылка);
		Стр = Набор.Добавить();
		Стр.СсылкаНаДокумент = ДокументОбъект.Ссылка;
		Набор.Записать();
		
		ВызватьИсключение ОписаниеОшибки();
		
	КонецПопытки;
	
	
КонецПроцедуры

функция МассивСтатусовДокумента(ВидОперации) Экспорт 
	
	мМассивСтатусов 	= Новый Массив; 
	мМассивСтатусов.Добавить(Справочники.СтатусыДокументов.ЭкспертизаНовый);
	
	Если ВидОперации = Перечисления.ВидыОперацийЭкспертиза.ОтказПоставщикаВВозврате
		ИЛИ ВидОперации = Перечисления.ВидыОперацийЭкспертиза.ПоступлениеНаЭкспертизуОтПокупателя Тогда
		
		мМассивСтатусов.Добавить(Справочники.СтатусыДокументов.ЭкспертизаПринят);
		мМассивСтатусов.Добавить(Справочники.СтатусыДокументов.ЭкспертизаРазмещен);
		
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийЭкспертиза.ПередачаНаЭкспертизуПоставщику Тогда
		
		мМассивСтатусов.Добавить(Справочники.СтатусыДокументов.ЭкспертизаОтгружен);
		
	КонецЕсли;
	
	Возврат мМассивСтатусов;
	
КонецФункции
